In [1]:
import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 3, 4])    #NONE missing data
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [4]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [5]:
1 + np.nan

nan

In [6]:
0 * np.nan

nan

In [7]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [8]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)   #numpy farkı

(8.0, 1.0, 4.0)

In [9]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [12]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [13]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [14]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [15]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [17]:
data.dropna()

0        1
2    hello
dtype: object

In [21]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [29]:
df.dropna() # nan  içeren tüm satır ve sütünu kaldırdı

     0    1  2
1  2.0  3.0  5

In [30]:
df.dropna(axis='rows')

     0    1  2
1  2.0  3.0  5

In [31]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [32]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [33]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [37]:
df.dropna(axis='rows', thresh=3) #satır veya sütünu belirtip min(thres) null değerine göre minden fazla olanlırı atar

     0    1  2   3
1  2.0  3.0  5 NaN

In [38]:
df.dropna(axis='rows', thresh=2)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [39]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [40]:
data.fillna(0) # sıfır ile doldurduk

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [41]:
data.fillna(method='ffill') #önceki değeri forward-fill ile ileriye doğru yaydık

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [42]:
data.fillna(method='bfill') #sonraki değeri back-fill iel geriye doğru yaydık

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [43]:
df.fillna(method='ffill', axis=1) #dataframe'de seçtiğimiz eksene doldurma yapabiliriz

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0